tests/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:v1="http://schemas.conversesolutions.com/xsd/dmticta/v1">
    <soapenv:Header/>
    <soapenv:Body>
        <todo:getTodoRequest xmlns:todo="http://citrusframework.org/samples/todolist">
        </todo:getTodoRequest>
    </soapenv:Body>
</soapenv:Envelope>